<div>
    {{-- อาจารย์ ตารางอนุมัติเอกสาร --}}
    <div class="card">
        <div class="card-body">
            <h3>ตารางอนุมัติเอกสาร</h3>
            <table class="table">
                <thead>
                    <tr>
                        <th>#</th>
                        <th>ชื่อโปรเจค</th>
                        <th>ชื่อนักศึกษา</th>
                        <th>สถานะปรึกษา</th>
                        <th>สถานะการดำเนินงาน</th>
                        <th></th>
                    </tr>
                </thead>
                <tbody>
                    <tr>
                        <td>1</td>
                        <td>
                            <p>ระบบจัดการปริญญานิพนธ์</p>
                            <small>Thesis Management System</small>
                        </td>
                        <td>
                            <p>นายณัฐภูมิ ขำศรี</p>
                            <p>นักศึกษา 2</p>
                            <p>นักศึกษา 3</p>
                        </td>
                        <td>ที่ปรึกษาหลัก</td>
                        <td>กำลังดำเนินการอนุมัติ 01</td>
                        <td class="text-right">
                            <a class="btn btn-success btn-sm" href="#">อนุมัติเอกสาร</a>
                        </td>
                    </tr>
                    <!-- เพิ่มแถวใหม่ที่นี่หากต้องการ -->
                </tbody>
            </table>
        </div>
    </div>

    {{-- อาจารย์ที่ปรึกษาหลัก ยืนยันเอกสาร 01 --}}
    <div class="card">
        <div class="card-header">
            <h3>คุณได้รับเชิญเป็นอาจารย์ที่ปรึกษาหลัก</h3>
        </div>
        <div class="card-body">
            <table class="table">
                <thead>
                    <tr>
                        <th style="width: 20%">หัวข้อ</th>
                        <th style="width: auto">รายละเอียด</th>
                    </tr>
                </thead>
                <tbody>
                    <tr>
                        <th>นักศึกษาลำดับที่ 1</th>
                        <td>
                            <b>ชื่อ : </b>นาย ณัฐภูมิ ขำศรี <b>รหัสนักศึกษา : </b>64222110108-4<br>
                            <b>หลักสูตร : </b>วิทยาการคอมพิวเตอร์ <b>สาขา : </b>เทคโนโลยีคอมพิวเตอร์<br>
                            <b>ระดับ : </b>ปริญาตรี 4 ปี <b>ภาค : </b>ปกติ
                        </td>
                    </tr>
                    <tr>
                        <th>ชื่อเรื่องโครงงานปริญญานิพนธ์</th>
                        <td>
                            <b>ภาษาไทย : </b>ระบบจัดการปริญญานิพนธ์<br>
                            <b>ภาษาอังกฤษ : </b>Thesis Management System
                        </td>
                    </tr>
                    <tr>
                        <th>อาจารย์ที่ปรึกษาหลัก</th>
                        <td>
                            <b>ชื่อ : </b>อาจารย์ จีรานันต์ ตะสันเทียะ <b>ตำแหน่งทางวิชาการ : </b>อาจารย์<br>
                            <b>วุฒิการศึกษา : </b>ค.อ.ม เทคโนโลยีคอมพิวเตอร์ วท.บ วิทยาการคอมพิวเตอร์<br>
                            <b>สาขาที่จบการศึกษา : </b>คอมพิวเตอร์
                        </td>
                    </tr>
                    <tr>
                        <th>อาจารย์ที่ปรึกษาร่วมลำดับที่ 1</th>
                        <td>
                            <b>ชื่อ : </b>อาจารย์ จีรานันต์ ตะสันเทียะ <b>ตำแหน่งทางวิชาการ : </b>อาจารย์<br>
                            <b>วุฒิการศึกษา : </b>ค.อ.ม เทคโนโลยีคอมพิวเตอร์ วท.บ วิทยาการคอมพิวเตอร์<br>
                            <b>สาขาที่จบการศึกษา : </b>คอมพิวเตอร์
                        </td>
                    </tr>
                    <tr>
                        <th>อาจารย์ที่ปรึกษาร่วมลำดับที่ 2</th>
                        <td>
                            <b>ชื่อ : </b>อาจารย์ จีรานันต์ ตะสันเทียะ <b>ตำแหน่งทางวิชาการ : </b>อาจารย์<br>
                            <b>วุฒิการศึกษา : </b>ค.อ.ม เทคโนโลยีคอมพิวเตอร์ วท.บ วิทยาการคอมพิวเตอร์<br>
                            <b>สาขาที่จบการศึกษา : </b>คอมพิวเตอร์
                        </td>
                    </tr>
                    <tr>
                        <th>อาจารย์ที่ปรึกษาร่วมลำดับที่ 3</th>
                        <td>
                            <b>ชื่อ : </b>อาจารย์ จีรานันต์ ตะสันเทียะ <b>ตำแหน่งทางวิชาการ : </b>อาจารย์<br>
                            <b>วุฒิการศึกษา : </b>ค.อ.ม เทคโนโลยีคอมพิวเตอร์ วท.บ วิทยาการคอมพิวเตอร์<br>
                            <b>สาขาที่จบการศึกษา : </b>คอมพิวเตอร์
                        </td>
                    </tr>
                    <tr>
                        <th>ตอบรับคำเชิญ</th>
                        <td class="text-right">
                            <button type="button" class="btn btn-success">ตอบรับคำเชิญ</button>
                        </td>
                    </tr>
                </tbody>
            </table>
        </div>
    </div>

    {{-- อาจารย์ที่ปรึกษาร่วม ยืนยันเอกสาร 01 --}}
    <div class="card">
        <div class="card-header">
            <h3>คุณได้รับเชิญเป็นอาจารย์ที่ปรึกษาร่วม</h3>
        </div>
        <div class="card-body">
            <table class="table">
                <thead>
                    <tr>
                        <th style="width: 20%">หัวข้อ</th>
                        <th style="width: auto">รายละเอียด</th>
                    </tr>
                </thead>
                <tbody>
                    <tr>
                        <th>นักศึกษาลำดับที่ 1</th>
                        <td>
                            <b>ชื่อ : </b>นาย ณัฐภูมิ ขำศรี <b>รหัสนักศึกษา : </b>64222110108-4<br>
                            <b>หลักสูตร : </b>วิทยาการคอมพิวเตอร์ <b>สาขา : </b>เทคโนโลยีคอมพิวเตอร์<br>
                            <b>ระดับ : </b>ปริญาตรี 4 ปี <b>ภาค : </b>ปกติ
                        </td>
                    </tr>
                    <tr>
                        <th>ชื่อเรื่องโครงงานปริญญานิพนธ์</th>
                        <td>
                            <b>ภาษาไทย : </b>ระบบจัดการปริญญานิพนธ์<br>
                            <b>ภาษาอังกฤษ : </b>Thesis Management System
                        </td>
                    </tr>
                    <tr>
                        <th>อาจารย์ที่ปรึกษาหลัก</th>
                        <td>
                            <b>ชื่อ : </b>อาจารย์ จีรานันต์ ตะสันเทียะ <b>ตำแหน่งทางวิชาการ : </b>อาจารย์<br>
                            <b>วุฒิการศึกษา : </b>ค.อ.ม เทคโนโลยีคอมพิวเตอร์ วท.บ วิทยาการคอมพิวเตอร์<br>
                            <b>สาขาที่จบการศึกษา : </b>คอมพิวเตอร์
                        </td>
                    </tr>
                    <tr>
                        <th>อาจารย์ที่ปรึกษาร่วมลำดับที่ 1</th>
                        <td>
                            <b>ชื่อ : </b>อาจารย์ จีรานันต์ ตะสันเทียะ <b>ตำแหน่งทางวิชาการ : </b>อาจารย์<br>
                            <b>วุฒิการศึกษา : </b>ค.อ.ม เทคโนโลยีคอมพิวเตอร์ วท.บ วิทยาการคอมพิวเตอร์<br>
                            <b>สาขาที่จบการศึกษา : </b>คอมพิวเตอร์
                        </td>
                    </tr>
                    <tr>
                        <th>อาจารย์ที่ปรึกษาร่วมลำดับที่ 2</th>
                        <td>
                            <b>ชื่อ : </b>อาจารย์ จีรานันต์ ตะสันเทียะ <b>ตำแหน่งทางวิชาการ : </b>อาจารย์<br>
                            <b>วุฒิการศึกษา : </b>ค.อ.ม เทคโนโลยีคอมพิวเตอร์ วท.บ วิทยาการคอมพิวเตอร์<br>
                            <b>สาขาที่จบการศึกษา : </b>คอมพิวเตอร์
                        </td>
                    </tr>
                    <tr>
                        <th>อาจารย์ที่ปรึกษาร่วมลำดับที่ 3</th>
                        <td>
                            <b>ชื่อ : </b>อาจารย์ จีรานันต์ ตะสันเทียะ <b>ตำแหน่งทางวิชาการ : </b>อาจารย์<br>
                            <b>วุฒิการศึกษา : </b>ค.อ.ม เทคโนโลยีคอมพิวเตอร์ วท.บ วิทยาการคอมพิวเตอร์<br>
                            <b>สาขาที่จบการศึกษา : </b>คอมพิวเตอร์
                        </td>
                    </tr>
                    <tr>
                        <th>ตอบรับคำเชิญ</th>
                        <td class="text-right">
                            <button type="button" class="btn btn-success">ตอบรับคำเชิญ</button>
                        </td>
                    </tr>
                </tbody>
            </table>
        </div>
    </div>
</div>